app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "description", "status", "priority", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        todo = user.todos.create(todo_params)

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 2], ["id", 3], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "priority" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Add Todo Endpoint - change"], ["priority", 1], ["updated_at", "2023-03-23 09:53:01.437366"], ["id", 3]]
---
    def update
        todo = user.todos.find(params[:id]).update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 3]]
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 2], ["id", 3], ["LIMIT", 1]]
---
    def destroy
        todo = user.todos.find(params[:id]).destroy

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ?  [["user_id", 2]]
---
    def index
        todos = user.todos.all