app/controllers/users_controller.rb

    def register
        user = User.create(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "marvin"], ["email", "marvin@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-23 08:08:51.050296"], ["updated_at", "2023-03-23 08:08:51.050296"]]

    def login
        sql = "username = :username OR email = :email"
        # user = User.find_by(username: params[:username])
        user = User.where(sql, {username: user_params[:username], email: user_params[:email]}).first
---
SELECT "users".* FROM "users" WHERE (username = 'marvin' OR email = 'marvin@gmail.com') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]